Revit 2024 API
WorksetKind Enumeration
 Indicates one of the standard kinds of workset (as available in the UI).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum WorksetKind
Visual Basic
Public Enumeration WorksetKind
Visual C++
public enum class WorksetKind
Members
Member name | Description
OtherWorkset |  Any workset which is not one of the standard types included in this enum.
FamilyWorkset |  Workset containing a family.
ViewWorkset |  Workset containing a view.
StandardWorkset |  Workset containing a standard.
UserWorkset |  Workset defined by users, including the two default worksets created by Revit
See Also
Autodesk.Revit.DB Namespace